class AccordionHeaders:
    ACCORDION_HEADER_0_PRICE_TEXT = "Сколько это стоит? И как оплатить?"
    ACCORDION_HEADER_1_QUANTITY_TEXT = "Хочу сразу несколько самокатов! Так можно?"
    ACCORDION_HEADER_2_TIME_TEXT = "Как рассчитывается время аренды?"
    ACCORDION_HEADER_3_DATE_TEXT = "Можно ли заказать самокат прямо на сегодня?"
    ACCORDION_HEADER_4_DURATION_TEXT = "Можно ли продлить заказ или вернуть самокат раньше?"
    ACCORDION_HEADER_5_CHARGE_TEXT = "Вы привозите зарядку вместе с самокатом?"
    ACCORDION_HEADER_6_CANCEL_TEXT = "Можно ли отменить заказ?"
    ACCORDION_HEADER_7_LOCATION_TEXT = "Я жизу за МКАДом, привезёте?"


class AccordionTexts:
    ACCORDION_TEXT_0_PRICE_TEXT = "Сутки — 400 рублей. Оплата курьеру — наличными или картой."
    ACCORDION_TEXT_1_QUANTITY_TEXT = (
        "Пока что у нас так: один заказ — один самокат. Если хотите покататься с друзьями, "
        "можете просто сделать несколько заказов — один за другим.")
    ACCORDION_TEXT_2_TIME_TEXT = (
        "Допустим, вы оформляете заказ на 8 мая. Мы привозим самокат 8 мая в течение дня. Отсчёт "
        "времени аренды начинается с момента, когда вы оплатите заказ курьеру. Если мы привезли "
        "самокат 8 мая в 20:30, суточная аренда закончится 9 мая в 20:30.")
    ACCORDION_TEXT_3_DATE_TEXT = "Только начиная с завтрашнего дня. Но скоро станем расторопнее."
    ACCORDION_TEXT_4_DURATION_TEXT = ("Пока что нет! Но если что-то срочное — всегда можно позвонить в поддержку по "
                                      "красивому номеру 1010.")
    ACCORDION_TEXT_5_CHARGE_TEXT = (
        "Самокат приезжает к вам с полной зарядкой. Этого хватает на восемь суток — даже если "
        "будете кататься без передышек и во сне. Зарядка не понадобится.")
    ACCORDION_TEXT_6_CANCEL_TEXT = ("Да, пока самокат не привезли. Штрафа не будет, объяснительной записки тоже не "
                                    "попросим. Все же свои.")
    ACCORDION_TEXT_7_LOCATION_TEXT = "Да, обязательно. Всем самокатов! И Москве, и Московской области."
